In [29]:
import numpy as np

In [30]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [31]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [32]:
sozluk

{'var1': array([8, 1, 5, 2, 3]),
 'var2': array([0, 9, 5, 1, 2]),
 'var3': array([3, 2, 9, 3, 0])}

In [33]:
df=pd.DataFrame(sozluk)

In [34]:
df

   var1  var2  var3
0     8     0     3
1     1     9     2
2     5     5     9
3     2     1     3
4     3     2     0

In [35]:
df[0:1]

   var1  var2  var3
0     8     0     3

In [36]:
df.index=["a","b","c","d","e"]

In [37]:
df

   var1  var2  var3
a     8     0     3
b     1     9     2
c     5     5     9
d     2     1     3
e     3     2     0

In [38]:
df["c":"e"]

   var1  var2  var3
c     5     5     9
d     2     1     3
e     3     2     0

# Silme

In [39]:
df.drop("a",axis=0)

   var1  var2  var3
b     1     9     2
c     5     5     9
d     2     1     3
e     3     2     0

In [40]:
df

   var1  var2  var3
a     8     0     3
b     1     9     2
c     5     5     9
d     2     1     3
e     3     2     0

In [41]:
df.drop("a",axis=0,inplace=True)

In [42]:
df

   var1  var2  var3
b     1     9     2
c     5     5     9
d     2     1     3
e     3     2     0

# Fancy

In [43]:
l=["c","e"]

In [47]:
df.drop(l,axis=0)

   var1  var2  var3
b     1     9     2
d     2     1     3

# Değişkenler için

In [48]:
"var1" in df

True

In [49]:
l=["var1","var4","var2"]

In [50]:
for i in l:
    print(i in df)

True
False
True

In [51]:
df

   var1  var2  var3
b     1     9     2
c     5     5     9
d     2     1     3
e     3     2     0

In [53]:
df["var4"]=df["var1"]/df["var2"]

In [54]:
df

   var1  var2  var3      var4
b     1     9     2  0.111111
c     5     5     9  1.000000
d     2     1     3  2.000000
e     3     2     0  1.500000